package by.epam.tr.main;
public class Vetvlen03 {

	public static void main(String[] args) {
		 
		double a = 3.1; 
		double b = 3.0;
		
		if(a < b) {
		System.out.println("yes");

	}else
		System.out.println("no");

}
}

//Вывести на экран слово «yes», если число а меньше
// 3; если больше, то вывести слово «no».