package by.epam.tr.main;

public class Line07 {

	public static void main(String[] args) {
		// Дан прямоугольник, ширина котрого в 2 раза меньше длины. Найти площадь прямоугольника
		
		double length = 10;
		double width = length / 2;
		double S = length * width;
		
		System.out.println("площадь прямоугольника = " + S);

	}

}
